docs/gem5_errors.org
#+TITLE: Troubleshooting gem5 Errors
#+AUTHOR: Pierre Ayoub
#+EMAIL: pierre.ayoub@eurecom.fr
#+LANGUAGE: en
#+PROPERTY: header-args :eval never-export
#+HTML_HEAD: <link rel="stylesheet" href="https://sandyuraz.com/styles/org.min.css">

* Introduction

  This guide reference some gem5 errors that we had to solve during our
  development. This is far from a complete list, but still, it might help
  someone.

** AttributeError: Can't resolve proxy 'any' of type 'XXX' from 'XXX'

*** *Goal*

    - This is the error we will troubleshoot:
      #+BEGIN_EXAMPLE
      AttributeError: Can't resolve proxy 'any' of type 'ArmSystem' from 'system.realview.generic_timer'
      #+END_EXAMPLE

*** *Explanation*

    - The /proxy parameter/ in /gem5/ is a /Python/ helper mechanism which is
      used to handle, affect and verify parameters of =SimObject=. It's
      implemented in the =Gem5/src/python/m5/proxy.py= file.
    - A /special proxy paramater/ is a /proxy parameter/ which have a dedicated
      class into the =proxy.py= file. Consider this /special proxy parameter/
      (=Parent.any=):
      #+BEGIN_SRC python :eval never
      system = Param.System(Parent.any, "The system the object is part of")
      #+END_SRC
      - This is its special implementation:
      #+BEGIN_SRC python :eval never
      class AnyProxy(BaseProxy):
          def find(self, obj):
              return obj.find_any(self._pdesc.ptype)

          def path(self):
              return 'any'
      #+END_SRC
      - And that's mean "We will affect to the =system= attribute of the
        current object any object of type =System= find into the parent
        object". It allow to affect a precise type of variable without knowing
        it's name in the parent object.

*** *Resolution*

    - To resolve our problem, we have to find the /special proxy parameter/:
      - =system= inherit from =System= class (=System.py=) ;
      - =system.realview= is of =VExpress_GEM5_V1= class (=RealView.py=) ;
      - =system.realview.generic_timer= is of =GenericTimer= class (=GenericTimer.py=).
    - In the =GenericTimer= class, we can find the /special proxy parameter/
      mentioned in the message:
      #+BEGIN_SRC python :eval never
      system = Param.ArmSystem(Parent.any, "system")
      #+END_SRC
    - This parameter search for an =ArmSystem= in the parent (=VExpress_GEM5_V1=).
    - The =VExpress_GEM5_V1= class has a =system= attribute which is our
      =system= object here.
    - Therefore, our =GenericTimer= will find a =System= object but not the
      specialized =ArmSystem= object, which produce the error of matching
      type.
    - Finally, to resolve the /proxy/ error, we have to change our =system=
      object to an =ArmSystem= object, or an object which inherit or the
      =ArmSystem=.

** gem5 has encountered a segmentation fault!

*** *Goal*

    - Troubleshoot this kind of, is not understand, cryptic error:
      #+BEGIN_EXAMPLE
      gem5 has encountered a segmentation fault!

      --- BEGIN LIBC BACKTRACE ---
      /opt/Gem5/build/ARM/gem5.opt(+0xd14cc9)[0x5579a2c41cc9]
      /opt/Gem5/build/ARM/gem5.opt(+0xd2781f)[0x5579a2c5481f]
      /lib/x86_64-linux-gnu/libpthread.so.0(+0x14140)[0x7f766cdc8140]
      /opt/Gem5/build/ARM/gem5.opt(+0x134d5d4)[0x5579a327a5d4]
      /opt/Gem5/build/ARM/gem5.opt(+0x13504f2)[0x5579a327d4f2]
      /opt/Gem5/build/ARM/gem5.opt(+0x9b3a8f)[0x5579a28e0a8f]
      /opt/Gem5/build/ARM/gem5.opt(+0x586ebe)[0x5579a24b3ebe]
      /lib/x86_64-linux-gnu/libpython3.8.so.1.0(+0xa1a78)[0x7f766ce77a78]
      /lib/x86_64-linux-gnu/libpython3.8.so.1.0(_PyObject_MakeTpCall+0xa7)[0x7f766ce78817]
      /lib/x86_64-linux-gnu/libpython3.8.so.1.0(+0xa37d0)[0x7f766ce797d0]
      /lib/x86_64-linux-gnu/libpython3.8.so.1.0(+0x7dc4d)[0x7f766ce53c4d]
      /lib/x86_64-linux-gnu/libpython3.8.so.1.0(_PyEval_EvalFrameDefault+0x7639)[0x7f766ce518f9]
      /lib/x86_64-linux-gnu/libpython3.8.so.1.0(+0x73073)[0x7f766ce49073]
      /lib/x86_64-linux-gnu/libpython3.8.so.1.0(+0xa379a)[0x7f766ce7979a]
      /lib/x86_64-linux-gnu/libpython3.8.so.1.0(+0x7dc4d)[0x7f766ce53c4d]
      /lib/x86_64-linux-gnu/libpython3.8.so.1.0(_PyEval_EvalFrameDefault+0x7639)[0x7f766ce518f9]
      /lib/x86_64-linux-gnu/libpython3.8.so.1.0(+0x73073)[0x7f766ce49073]
      /lib/x86_64-linux-gnu/libpython3.8.so.1.0(+0xa379a)[0x7f766ce7979a]
      /lib/x86_64-linux-gnu/libpython3.8.so.1.0(+0x7dc4d)[0x7f766ce53c4d]
      /lib/x86_64-linux-gnu/libpython3.8.so.1.0(_PyEval_EvalFrameDefault+0x7639)[0x7f766ce518f9]
      /lib/x86_64-linux-gnu/libpython3.8.so.1.0(+0x73073)[0x7f766ce49073]
      /lib/x86_64-linux-gnu/libpython3.8.so.1.0(+0x7dc4d)[0x7f766ce53c4d]
      /lib/x86_64-linux-gnu/libpython3.8.so.1.0(_PyEval_EvalFrameDefault+0x7639)[0x7f766ce518f9]
      /lib/x86_64-linux-gnu/libpython3.8.so.1.0(+0x73073)[0x7f766ce49073]
      /lib/x86_64-linux-gnu/libpython3.8.so.1.0(+0x7dc4d)[0x7f766ce53c4d]
      /lib/x86_64-linux-gnu/libpython3.8.so.1.0(_PyEval_EvalFrameDefault+0x1292)[0x7f766ce4b552]
      /lib/x86_64-linux-gnu/libpython3.8.so.1.0(_PyEval_EvalCodeWithName+0x8df)[0x7f766cf50ebf]
      /lib/x86_64-linux-gnu/libpython3.8.so.1.0(PyEval_EvalCodeEx+0x3e)[0x7f766cf5125e]
      /lib/x86_64-linux-gnu/libpython3.8.so.1.0(PyEval_EvalCode+0x1b)[0x7f766cf4faab]
      /lib/x86_64-linux-gnu/libpython3.8.so.1.0(+0x175531)[0x7f766cf4b531]
      /lib/x86_64-linux-gnu/libpython3.8.so.1.0(+0xe60a3)[0x7f766cebc0a3]
      /lib/x86_64-linux-gnu/libpython3.8.so.1.0(+0x7dc4d)[0x7f766ce53c4d]
      --- END LIBC BACKTRACE ---
      #+END_EXAMPLE

