docs/gem5_errors.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-03-31 mer. 11:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Troubleshooting gem5 Errors</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Pierre Ayoub" />
<link rel="stylesheet" href="https://sandyuraz.com/styles/org.min.css">
</head>
<body>
<div id="content">
<h1 class="title">Troubleshooting gem5 Errors</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf1198c4">1. Introduction</a>
<ul>
<li><a href="#org05072ef">1.1. AttributeError: Can't resolve proxy 'any' of type 'XXX' from 'XXX'</a>
<ul>
<li><a href="#org430ba70">1.1.1. <b>Goal</b></a></li>
<li><a href="#orgf33ff7c">1.1.2. <b>Explanation</b></a></li>
<li><a href="#orgc1e7486">1.1.3. <b>Resolution</b></a></li>
</ul>
</li>
<li><a href="#orgc614605">1.2. gem5 has encountered a segmentation fault!</a>
<ul>
<li><a href="#org8465b26">1.2.1. <b>Goal</b></a></li>
<li><a href="#org11b35d9">1.2.2. <b>Explanation</b></a></li>
<li><a href="#orgd8d4a11">1.2.3. <b>Resolution</b></a></li>
</ul>
</li>
<li><a href="#org7cdfcb7">1.3. fatal: XXX</a>
<ul>
<li><a href="#org51f2aa3">1.3.1. <b>Goal</b></a></li>
<li><a href="#org92c8395">1.3.2. <b>Explanation</b></a></li>
<li><a href="#orgd899ce0">1.3.3. <b>Resolution</b></a></li>
</ul>
</li>
<li><a href="#orge766941">1.4. panic: XXX port of XXX not connected to anything!</a>
<ul>
<li><a href="#orge6377c0">1.4.1. <b>Goal</b></a></li>
<li><a href="#orgf0fc469">1.4.2. <b>Explanation</b></a></li>
<li><a href="#orge8432cf">1.4.3. <b>Resolution</b></a></li>
</ul>
</li>
<li><a href="#org305b67b">1.5. Kernel panic - not syncing: VFS: Unable to mount root fs</a>
<ul>
<li><a href="#orgef1c2ae">1.5.1. <b>Goal</b></a></li>
<li><a href="#org42106db">1.5.2. <b>Explanation</b></a></li>
<li><a href="#org9b939af">1.5.3. <b>Resolution</b></a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgf1198c4" class="outline-2">
<h2 id="orgf1198c4"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This guide reference some gem5 errors that we had to solve during our
development. This is far from a complete list, but still, it might help
someone.
</p>
</div>

<div id="outline-container-org05072ef" class="outline-3">
<h3 id="org05072ef"><span class="section-number-3">1.1</span> AttributeError: Can't resolve proxy 'any' of type 'XXX' from 'XXX'</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org430ba70" class="outline-4">
<h4 id="org430ba70"><span class="section-number-4">1.1.1</span> <b>Goal</b></h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li><p>
This is the error we will troubleshoot:
</p>
<pre class="example" id="org665ad6a">
AttributeError: Can't resolve proxy 'any' of type 'ArmSystem' from 'system.realview.generic_timer'
</pre></li>
</ul>
</div>
</div>

<div id="outline-container-orgf33ff7c" class="outline-4">
<h4 id="orgf33ff7c"><span class="section-number-4">1.1.2</span> <b>Explanation</b></h4>
<div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li>The <i>proxy parameter</i> in <i>gem5</i> is a <i>Python</i> helper mechanism which is
used to handle, affect and verify parameters of <code>SimObject</code>. It's
implemented in the <code>Gem5/src/python/m5/proxy.py</code> file.</li>
<li><p>
A <i>special proxy paramater</i> is a <i>proxy parameter</i> which have a dedicated
class into the <code>proxy.py</code> file. Consider this <i>special proxy parameter</i>
(<code>Parent.any</code>):
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #47ba99;">system</span> = Param.System<span style="color: #4EB8CA;">(</span>Parent.<span style="color: #91b9c7;">any</span>, <span style="color: #fbaed2;">"The system the object is part of"</span><span style="color: #4EB8CA;">)</span>
</pre>
</div>
<ul class="org-ul">
<li>This is its special implementation:</li>
</ul>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4EB8CA;">class</span> <span style="color: #b9c791;">AnyProxy</span><span style="color: #4EB8CA;">(</span>BaseProxy<span style="color: #4EB8CA;">)</span>:
    <span style="color: #4EB8CA;">def</span> <span style="color: #91b9c7;">find</span><span style="color: #4EB8CA;">(</span><span style="color: #4EB8CA;">self</span>, obj<span style="color: #4EB8CA;">)</span>:
        <span style="color: #4EB8CA;">return</span> obj.find_any<span style="color: #4EB8CA;">(</span><span style="color: #4EB8CA;">self</span>._pdesc.ptype<span style="color: #4EB8CA;">)</span>

    <span style="color: #4EB8CA;">def</span> <span style="color: #91b9c7;">path</span><span style="color: #4EB8CA;">(</span><span style="color: #4EB8CA;">self</span><span style="color: #4EB8CA;">)</span>:
        <span style="color: #4EB8CA;">return</span> <span style="color: #fbaed2;">'any'</span>
</pre>
</div>
<ul class="org-ul">
<li>And that's mean "We will affect to the <code>system</code> attribute of the
current object any object of type <code>System</code> find into the parent
object". It allow to affect a precise type of variable without knowing
it's name in the parent object.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgc1e7486" class="outline-4">
<h4 id="orgc1e7486"><span class="section-number-4">1.1.3</span> <b>Resolution</b></h4>
<div class="outline-text-4" id="text-1-1-3">
<ul class="org-ul">
<li>To resolve our problem, we have to find the <i>special proxy parameter</i>:
<ul class="org-ul">
<li><code>system</code> inherit from <code>System</code> class (<code>System.py</code>) ;</li>
<li><code>system.realview</code> is of <code>VExpress_GEM5_V1</code> class (<code>RealView.py</code>) ;</li>
<li><code>system.realview.generic_timer</code> is of <code>GenericTimer</code> class (<code>GenericTimer.py</code>).</li>
</ul></li>
<li><p>
In the <code>GenericTimer</code> class, we can find the <i>special proxy parameter</i>
mentioned in the message:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #47ba99;">system</span> = Param.ArmSystem<span style="color: #4EB8CA;">(</span>Parent.<span style="color: #91b9c7;">any</span>, <span style="color: #fbaed2;">"system"</span><span style="color: #4EB8CA;">)</span>
</pre>
</div></li>
<li>This parameter search for an <code>ArmSystem</code> in the parent (<code>VExpress_GEM5_V1</code>).</li>
<li>The <code>VExpress_GEM5_V1</code> class has a <code>system</code> attribute which is our
<code>system</code> object here.</li>
<li>Therefore, our <code>GenericTimer</code> will find a <code>System</code> object but not the
specialized <code>ArmSystem</code> object, which produce the error of matching
type.</li>
<li>Finally, to resolve the <i>proxy</i> error, we have to change our <code>system</code>
object to an <code>ArmSystem</code> object, or an object which inherit or the
<code>ArmSystem</code>.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgc614605" class="outline-3">
<h3 id="orgc614605"><span class="section-number-3">1.2</span> gem5 has encountered a segmentation fault!</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org8465b26" class="outline-4">
<h4 id="org8465b26"><span class="section-number-4">1.2.1</span> <b>Goal</b></h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li><p>
Troubleshoot this kind of, is not understand, cryptic error:
</p>
<pre class="example" id="org2c065ac">
gem5 has encountered a segmentation fault!

--- BEGIN LIBC BACKTRACE ---
/opt/Gem5/build/ARM/gem5.opt(+0xd14cc9)[0x5579a2c41cc9]
/opt/Gem5/build/ARM/gem5.opt(+0xd2781f)[0x5579a2c5481f]
/lib/x86_64-linux-gnu/libpthread.so.0(+0x14140)[0x7f766cdc8140]
/opt/Gem5/build/ARM/gem5.opt(+0x134d5d4)[0x5579a327a5d4]
/opt/Gem5/build/ARM/gem5.opt(+0x13504f2)[0x5579a327d4f2]
/opt/Gem5/build/ARM/gem5.opt(+0x9b3a8f)[0x5579a28e0a8f]
/opt/Gem5/build/ARM/gem5.opt(+0x586ebe)[0x5579a24b3ebe]
/lib/x86_64-linux-gnu/libpython3.8.so.1.0(+0xa1a78)[0x7f766ce77a78]
/lib/x86_64-linux-gnu/libpython3.8.so.1.0(_PyObject_MakeTpCall+0xa7)[0x7f766ce78817]
/lib/x86_64-linux-gnu/libpython3.8.so.1.0(+0xa37d0)[0x7f766ce797d0]
/lib/x86_64-linux-gnu/libpython3.8.so.1.0(+0x7dc4d)[0x7f766ce53c4d]
/lib/x86_64-linux-gnu/libpython3.8.so.1.0(_PyEval_EvalFrameDefault+0x7639)[0x7f766ce518f9]
/lib/x86_64-linux-gnu/libpython3.8.so.1.0(+0x73073)[0x7f766ce49073]
/lib/x86_64-linux-gnu/libpython3.8.so.1.0(+0xa379a)[0x7f766ce7979a]
/lib/x86_64-linux-gnu/libpython3.8.so.1.0(+0x7dc4d)[0x7f766ce53c4d]
/lib/x86_64-linux-gnu/libpython3.8.so.1.0(_PyEval_EvalFrameDefault+0x7639)[0x7f766ce518f9]
/lib/x86_64-linux-gnu/libpython3.8.so.1.0(+0x73073)[0x7f766ce49073]
/lib/x86_64-linux-gnu/libpython3.8.so.1.0(+0xa379a)[0x7f766ce7979a]
/lib/x86_64-linux-gnu/libpython3.8.so.1.0(+0x7dc4d)[0x7f766ce53c4d]
/lib/x86_64-linux-gnu/libpython3.8.so.1.0(_PyEval_EvalFrameDefault+0x7639)[0x7f766ce518f9]
/lib/x86_64-linux-gnu/libpython3.8.so.1.0(+0x73073)[0x7f766ce49073]
/lib/x86_64-linux-gnu/libpython3.8.so.1.0(+0x7dc4d)[0x7f766ce53c4d]
/lib/x86_64-linux-gnu/libpython3.8.so.1.0(_PyEval_EvalFrameDefault+0x7639)[0x7f766ce518f9]
/lib/x86_64-linux-gnu/libpython3.8.so.1.0(+0x73073)[0x7f766ce49073]
/lib/x86_64-linux-gnu/libpython3.8.so.1.0(+0x7dc4d)[0x7f766ce53c4d]
/lib/x86_64-linux-gnu/libpython3.8.so.1.0(_PyEval_EvalFrameDefault+0x1292)[0x7f766ce4b552]
/lib/x86_64-linux-gnu/libpython3.8.so.1.0(_PyEval_EvalCodeWithName+0x8df)[0x7f766cf50ebf]
/lib/x86_64-linux-gnu/libpython3.8.so.1.0(PyEval_EvalCodeEx+0x3e)[0x7f766cf5125e]
/lib/x86_64-linux-gnu/libpython3.8.so.1.0(PyEval_EvalCode+0x1b)[0x7f766cf4faab]
/lib/x86_64-linux-gnu/libpython3.8.so.1.0(+0x175531)[0x7f766cf4b531]
/lib/x86_64-linux-gnu/libpython3.8.so.1.0(+0xe60a3)[0x7f766cebc0a3]
/lib/x86_64-linux-gnu/libpython3.8.so.1.0(+0x7dc4d)[0x7f766ce53c4d]
--- END LIBC BACKTRACE ---
</pre></li>
</ul>
</div>
</div>
