docs/gem5_errors.org
*** *Explanation*

    - Arrive often with a =NULL= pointer which is dereferenced in /gem5/, caused by:
      - A parameter that is asserted to be set, but in fact, it is not.
      - A port that this asserted to be linked, but in fact, it is not.

*** *Resolution*

    - Best thing is to use /gdb/ here.
    - Ideally, you should use the =gem5.debug= binary:

      #+BEGIN_SRC bash :eval never
      gdb $GEM5/build/ARM/gem5.opt
      run --debug-break=2000 -d /tmp $GEM5_SCRIPTS/RPIv4.py -v --fs --fs-kernel=$gem5_kernel --fs-disk-image=$gem5_disk
      #+END_SRC

    - Use trial and error to refine your =--debug-break= tick start to arrive
      where you want to go.
    - At some point, you will arrive at your segfault:

      #+BEGIN_EXAMPLE
      Program received signal SIGSEGV, Segmentation fault.
      0x00005555568a15d4 in ArmSystem::ArmSystem (this=0x5555595cfb00, p=0x555558cba1a0) at build/ARM/arch/arm/system.cc:77
      77	        _resetAddr = workload->getEntry();
      #+END_EXAMPLE
      #+BEGIN_EXAMPLE
      $rsp   : 0x00007fffffffc6c0  →  0x00007ffff50c6398  →  0x0000000000000000
      $rbp   : 0x00005555595cfb00  →  0x0000555557e10020  →  0x0000555556d1fd70  →  <ArmSystem::~ArmSystem()+0> lea rax, [rip+0x10f02a9]        # 0x555557e10020 <_ZTV9ArmSystem+16>
      $rsi   : 0x0000555557f3e0a0  →  0x0000555558f53140  →  0x0000555558f53120  →  0x000055555961c540  →  0x000055555961c560  →  0x000055555961c580  →  0x000055555961c5a0  →  0x000055555961c5c0
      $rdi   : 0x0               
      $rip   : 0x00005555568a15d4  →  <ArmSystem::ArmSystem(ArmSystemParams*)+276> mov rax, QWORD PTR [rdi]
      #+END_EXAMPLE
      #+BEGIN_EXAMPLE
         0x5555568a15c4 <ArmSystem::ArmSystem(ArmSystemParams*)+260> cmp    BYTE PTR [rbx+0x144], 0x0
         0x5555568a15cb <ArmSystem::ArmSystem(ArmSystemParams*)+267> je     0x5555568a1648 <ArmSystem::ArmSystem(ArmSystemParams*)+392>
         0x5555568a15cd <ArmSystem::ArmSystem(ArmSystemParams*)+269> mov    rdi, QWORD PTR [rbp+0x190]
       → 0x5555568a15d4 <ArmSystem::ArmSystem(ArmSystemParams*)+276> mov    rax, QWORD PTR [rdi]
      #+END_EXAMPLE
      #+BEGIN_EXAMPLE
           72	       _havePAN(p->have_pan),
           73	       semihosting(p->semihosting),
           74	       multiProc(p->multi_proc)
           75	 {
           76	     if (p->auto_reset_addr) {
       →   77	         _resetAddr = workload->getEntry();
      #+END_EXAMPLE

    - We have find the source of the =SEFGAULT=:
      - =workload->getEntry();= dereference =workload= pointer to call the =getEntry()= function.
      - =mov    rax, QWORD PTR [rdi]= is the pointer dereference in assembly.
      - =rdi= is set to =0x0=.
      - This lead to the segmentation fault. Hence, our workload is not well
        passed to our =ArmSystem= object. In fact, our workload was linked at
        the wrong =SimObject= by inadvertence.

** fatal: XXX

*** *Goal*

    - Troubleshoot this kind of error:
      #+BEGIN_EXAMPLE
      fatal: Must specify at least one workload!
      #+END_EXAMPLE

*** *Explanation*

    - This error is generated in the /C++/ source code of /gem5/, by its error
      handling mechanism.

*** *Resolution*

    - Best thing is to search for the error (without the error-level
      keyword) in the source code:
      #+BEGIN_SRC bash :results output :exports both
      ack "Must specify at least one workload" $GEM5/src
      #+END_SRC

      #+RESULTS:
      : /opt/Gem5/src/cpu/o3/deriv.cc:47:            fatal("Must specify at least one workload!");
       
    - We can then search, in the source code, the source of the error:
      #+BEGIN_SRC bash :results output :wrap "SRC C :eval never" :exports both
      sed -n '35,54'p /opt/Gem5/src/cpu/o3/deriv.cc
      #+END_SRC

      #+RESULTS:
      #+begin_SRC C :eval never
      DerivO3CPU *
      DerivO3CPUParams::create()
      {
          ThreadID actual_num_threads;
          if (FullSystem) {
              // Full-system only supports a single thread for the moment.
              actual_num_threads = 1;
          } else {
              if (workload.size() > numThreads) {
                  fatal("Workload Size (%i) > Max Supported Threads (%i) on This CPU",
                        workload.size(), numThreads);
              } else if (workload.size() == 0) {
                  fatal("Must specify at least one workload!");
              }

              // In non-full-system mode, we infer the number of threads from
              // the workload if it's not explicitly specified.
              actual_num_threads =
                  (numThreads >= workload.size()) ? numThreads : workload.size();
          }
      #+end_SRC

    - Here, we can understand that the =O3CPU= take the first =else= path,
      when he should have take the first =if= (because we are in /FS/
      mode). Then, the /CPU/ search for a workload linked on it, but there is
      not because, again, we are in /FS/ mode, therefore producing the fatal
      error.
    - To fix this particular error, you have to set =full_system=True=
      variable of the =Root= object.

** panic: XXX port of XXX not connected to anything!

*** *Goal*

    - Troubleshoot this kind of error:
      #+BEGIN_EXAMPLE
      panic: Pio port of system.realview.generic_timer_mem not connected to anything!
      #+END_EXAMPLE

*** *Explanation*

    - This error is generated in the /C++/ source code of /gem5/, by its error
      handling mechanism.
    - The reason is clear: the setup of one /SimObject/'s ports is badly
      programmed or forgotten.

