docs/gem5_errors.html

<div id="outline-container-org11b35d9" class="outline-4">
<h4 id="org11b35d9"><span class="section-number-4">1.2.2</span> <b>Explanation</b></h4>
<div class="outline-text-4" id="text-1-2-2">
<ul class="org-ul">
<li>Arrive often with a <code>NULL</code> pointer which is dereferenced in <i>gem5</i>, caused by:
<ul class="org-ul">
<li>A parameter that is asserted to be set, but in fact, it is not.</li>
<li>A port that this asserted to be linked, but in fact, it is not.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgd8d4a11" class="outline-4">
<h4 id="orgd8d4a11"><span class="section-number-4">1.2.3</span> <b>Resolution</b></h4>
<div class="outline-text-4" id="text-1-2-3">
<ul class="org-ul">
<li>Best thing is to use <i>gdb</i> here.</li>
<li><p>
Ideally, you should use the <code>gem5.debug</code> binary:
</p>

<div class="org-src-container">
<pre class="src src-bash">gdb $<span style="color: #47ba99;">GEM5</span>/build/ARM/gem5.opt
run --debug-break=<span style="color: #ef6787;">2000</span> -d /tmp $<span style="color: #47ba99;">GEM5_SCRIPTS</span>/RPIv4.py -v --fs --fs-kernel=$<span style="color: #47ba99;">gem5_kernel</span> --fs-disk-image=$<span style="color: #47ba99;">gem5_disk</span>
</pre>
</div></li>

<li>Use trial and error to refine your <code>--debug-break</code> tick start to arrive
where you want to go.</li>
<li><p>
At some point, you will arrive at your segfault:
</p>

<pre class="example" id="org1b2bfff">
Program received signal SIGSEGV, Segmentation fault.
0x00005555568a15d4 in ArmSystem::ArmSystem (this=0x5555595cfb00, p=0x555558cba1a0) at build/ARM/arch/arm/system.cc:77
77	        _resetAddr = workload-&gt;getEntry();
</pre>
<pre class="example" id="orga566a26">
$rsp   : 0x00007fffffffc6c0  →  0x00007ffff50c6398  →  0x0000000000000000
$rbp   : 0x00005555595cfb00  →  0x0000555557e10020  →  0x0000555556d1fd70  →  &lt;ArmSystem::~ArmSystem()+0&gt; lea rax, [rip+0x10f02a9]        # 0x555557e10020 &lt;_ZTV9ArmSystem+16&gt;
$rsi   : 0x0000555557f3e0a0  →  0x0000555558f53140  →  0x0000555558f53120  →  0x000055555961c540  →  0x000055555961c560  →  0x000055555961c580  →  0x000055555961c5a0  →  0x000055555961c5c0
$rdi   : 0x0               
$rip   : 0x00005555568a15d4  →  &lt;ArmSystem::ArmSystem(ArmSystemParams*)+276&gt; mov rax, QWORD PTR [rdi]
</pre>
<pre class="example" id="org823b33f">
  0x5555568a15c4 &lt;ArmSystem::ArmSystem(ArmSystemParams*)+260&gt; cmp    BYTE PTR [rbx+0x144], 0x0
  0x5555568a15cb &lt;ArmSystem::ArmSystem(ArmSystemParams*)+267&gt; je     0x5555568a1648 &lt;ArmSystem::ArmSystem(ArmSystemParams*)+392&gt;
  0x5555568a15cd &lt;ArmSystem::ArmSystem(ArmSystemParams*)+269&gt; mov    rdi, QWORD PTR [rbp+0x190]
→ 0x5555568a15d4 &lt;ArmSystem::ArmSystem(ArmSystemParams*)+276&gt; mov    rax, QWORD PTR [rdi]
</pre>
<pre class="example" id="orgddd50c1">
    72	       _havePAN(p-&gt;have_pan),
    73	       semihosting(p-&gt;semihosting),
    74	       multiProc(p-&gt;multi_proc)
    75	 {
    76	     if (p-&gt;auto_reset_addr) {
→   77	         _resetAddr = workload-&gt;getEntry();
</pre></li>

<li>We have find the source of the <code>SEFGAULT</code>:
<ul class="org-ul">
<li><code>workload-&gt;getEntry();</code> dereference <code>workload</code> pointer to call the <code>getEntry()</code> function.</li>
<li><code>mov    rax, QWORD PTR [rdi]</code> is the pointer dereference in assembly.</li>
<li><code>rdi</code> is set to <code>0x0</code>.</li>
<li>This lead to the segmentation fault. Hence, our workload is not well
passed to our <code>ArmSystem</code> object. In fact, our workload was linked at
the wrong <code>SimObject</code> by inadvertence.</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org7cdfcb7" class="outline-3">
<h3 id="org7cdfcb7"><span class="section-number-3">1.3</span> fatal: XXX</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org51f2aa3" class="outline-4">
<h4 id="org51f2aa3"><span class="section-number-4">1.3.1</span> <b>Goal</b></h4>
<div class="outline-text-4" id="text-1-3-1">
<ul class="org-ul">
<li><p>
Troubleshoot this kind of error:
</p>
<pre class="example" id="orgf828fe0">
fatal: Must specify at least one workload!
</pre></li>
</ul>
</div>
</div>

<div id="outline-container-org92c8395" class="outline-4">
<h4 id="org92c8395"><span class="section-number-4">1.3.2</span> <b>Explanation</b></h4>
<div class="outline-text-4" id="text-1-3-2">
<ul class="org-ul">
<li>This error is generated in the <i>C++</i> source code of <i>gem5</i>, by its error
handling mechanism.</li>
</ul>
</div>
</div>

<div id="outline-container-orgd899ce0" class="outline-4">
<h4 id="orgd899ce0"><span class="section-number-4">1.3.3</span> <b>Resolution</b></h4>
<div class="outline-text-4" id="text-1-3-3">
<ul class="org-ul">
<li><p>
Best thing is to search for the error (without the error-level
keyword) in the source code:
</p>
<div class="org-src-container">
<pre class="src src-bash">ack <span style="color: #fbaed2;">"Must specify at least one workload"</span> $<span style="color: #47ba99;">GEM5</span>/src
</pre>
</div>

<pre class="example">
/opt/Gem5/src/cpu/o3/deriv.cc:47:            fatal("Must specify at least one workload!");
</pre></li>

<li><p>
We can then search, in the source code, the source of the error:
</p>
<div class="org-src-container">
<pre class="src src-bash">sed -n <span style="color: #fbaed2;">'35,54'</span>p /opt/Gem5/src/cpu/o3/deriv.cc
</pre>
</div>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #b9c791;">DerivO3CPU</span> *
<span style="color: #91b9c7;">DerivO3CPUParams</span>::create<span style="color: #4EB8CA;">()</span>
<span style="color: #4EB8CA;">{</span>
    <span style="color: #b9c791;">ThreadID</span> <span style="color: #47ba99;">actual_num_threads</span>;
    <span style="color: #4EB8CA;">if</span> <span style="color: #91b9c7;">(</span>FullSystem<span style="color: #91b9c7;">)</span> <span style="color: #91b9c7;">{</span>
        <span style="color: #697375;">// </span><span style="color: #697375;">Full-system only supports a single thread for the moment.</span>
        actual_num_threads = <span style="color: #ef6787;">1</span>;
    <span style="color: #91b9c7;">}</span> <span style="color: #4EB8CA;">else</span> <span style="color: #91b9c7;">{</span>
        <span style="color: #4EB8CA;">if</span> <span style="color: #4FA8A3;">(</span>workload.size<span style="color: #c791aa;">()</span> &gt; numThreads<span style="color: #4FA8A3;">)</span> <span style="color: #4FA8A3;">{</span>
            fatal<span style="color: #c791aa;">(</span><span style="color: #fbaed2;">"Workload Size (%i) &gt; Max Supported Threads (%i) on This CPU"</span>,
                  workload.size<span style="color: #807f96;">()</span>, numThreads<span style="color: #c791aa;">)</span>;
        <span style="color: #4FA8A3;">}</span> <span style="color: #4EB8CA;">else</span> <span style="color: #4EB8CA;">if</span> <span style="color: #4FA8A3;">(</span>workload.size<span style="color: #c791aa;">()</span> == <span style="color: #ef6787;">0</span><span style="color: #4FA8A3;">)</span> <span style="color: #4FA8A3;">{</span>
            fatal<span style="color: #c791aa;">(</span><span style="color: #fbaed2;">"Must specify at least one workload!"</span><span style="color: #c791aa;">)</span>;
        <span style="color: #4FA8A3;">}</span>

        <span style="color: #697375;">// </span><span style="color: #697375;">In non-full-system mode, we infer the number of threads from</span>
        <span style="color: #697375;">// </span><span style="color: #697375;">the workload if it's not explicitly specified.</span>
        actual_num_threads =
            <span style="color: #4FA8A3;">(</span>numThreads &gt;= workload.size<span style="color: #c791aa;">()</span><span style="color: #4FA8A3;">)</span> ? numThreads : workload.size<span style="color: #4FA8A3;">()</span>;
    <span style="color: #91b9c7;">}</span>
</pre>
</div></li>

<li>Here, we can understand that the <code>O3CPU</code> take the first <code>else</code> path,
when he should have take the first <code>if</code> (because we are in <i>FS</i>
mode). Then, the <i>CPU</i> search for a workload linked on it, but there is
not because, again, we are in <i>FS</i> mode, therefore producing the fatal
error.</li>
<li>To fix this particular error, you have to set <code>full_system=True</code>
variable of the <code>Root</code> object.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orge766941" class="outline-3">
<h3 id="orge766941"><span class="section-number-3">1.4</span> panic: XXX port of XXX not connected to anything!</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-orge6377c0" class="outline-4">
<h4 id="orge6377c0"><span class="section-number-4">1.4.1</span> <b>Goal</b></h4>
<div class="outline-text-4" id="text-1-4-1">
<ul class="org-ul">
<li><p>
Troubleshoot this kind of error:
</p>
<pre class="example" id="org99e87ac">
panic: Pio port of system.realview.generic_timer_mem not connected to anything!
</pre></li>
</ul>
</div>
</div>

<div id="outline-container-orgf0fc469" class="outline-4">
<h4 id="orgf0fc469"><span class="section-number-4">1.4.2</span> <b>Explanation</b></h4>
<div class="outline-text-4" id="text-1-4-2">
<ul class="org-ul">
<li>This error is generated in the <i>C++</i> source code of <i>gem5</i>, by its error
handling mechanism.</li>
<li>The reason is clear: the setup of one <i>SimObject</i>'s ports is badly
programmed or forgotten.</li>
</ul>
</div>
</div>
