docs/gem5_errors.org
*** *Resolution*

    - The linkage of this port should perhaps have been done directly by you,
      or by an helper function already provided by /gem5/.
    - To distinguish between these two ways, search in the source code the
      concerned object (here, =system.realview.generic_timer_mem=). Understand
      its function, its ports, and so one.
    - One thing that can help a lot is the generated =config.dot.pdf=, which
      give a graphical representation of the system (with links between
      /SimObject/).

** Kernel panic - not syncing: VFS: Unable to mount root fs

*** *Goal*

    - Troubleshoot this /kernel panic/:
      #+BEGIN_EXAMPLE
      [    0.224367] List of all partitions:
      [    0.224394] fe00         1048320 vda 
      [    0.224397]  driver: virtio_blk
      [    0.224440]   fe01         1048288 vda1 00000000-01
      [    0.224441] 
      [    0.224480] No filesystem could mount root, tried: 
      [    0.224481]  ext3
      [    0.224510]  ext4
      [    0.224524]  ext2
      [    0.224537]  squashfs
      [    0.224551]  vfat
      [    0.224566]  fuseblk
      [    0.224579] 
      [    0.224606] Kernel panic - not syncing: VFS: Unable to mount root fs on unknown-block(254,0)
      [    0.224656] CPU: 0 PID: 1 Comm: swapper/0 Not tainted 4.18.0+ #1
      [    0.224692] Hardware name: V2P-CA15 (DT)
      [    0.224717] Call trace:
      [    0.224741]  dump_backtrace+0x0/0x1c0
      [    0.224765]  show_stack+0x14/0x20
      [    0.224790]  dump_stack+0x8c/0xac
      [    0.224812]  panic+0x130/0x288
      [    0.224836]  mount_block_root+0x22c/0x294
      [    0.224861]  mount_root+0x140/0x174
      [    0.224884]  prepare_namespace+0x138/0x180
      [    0.224910]  kernel_init_freeable+0x1c0/0x1e0
      [    0.224939]  kernel_init+0x10/0x108
      [    0.224961]  ret_from_fork+0x10/0x18
      [    0.224987] Kernel Offset: disabled
      [    0.225009] CPU features: 0x21c06492
      [    0.225032] Memory Limit: 2048 MB
      [    0.225056] ---[ end Kernel panic - not syncing: VFS: Unable to mount root fs on unknown-block(254,0) ]---

      #+END_EXAMPLE

*** *Explanation*

    - This error is generated by the /Linux/ kernel, in a
      full-system-emulation setup.
    - We can see, from the error:
      - The kernel recognize the /VirtIO/ block device, which means that this
        driver is correctly loaded.
      - The kernel tried the =ext= file system, which means that the file
        systems are correctly loaded.
      - The kernel detect a =vda1= partition.

*** *Resolution*

    - The problem lying into the *specification of the root partition*, on the
      *kernel command line*. In the full-system emulation script, we have to
      correctly set the root partition, like this:
      #+BEGIN_SRC python :eval never
      # Linux kernel boot command flags.
      kernel_cmd = [
          ...
          # Tell Linux where to find the root disk image.
          "root=/dev/vda1",
          ...
      ]
      system.workload.command_line = " ".join(kernel_cmd)
      #+END_SRC
    - Don't forget to replace =...= with other correct options.
    - Before our modification, the /VirtIO/ block device was specified
      (=/dev/vda=). The kernel wants a partition (=/dev/vda1=), not a block
      device.
  
