docs/gem5_errors.html

<div id="outline-container-orge8432cf" class="outline-4">
<h4 id="orge8432cf"><span class="section-number-4">1.4.3</span> <b>Resolution</b></h4>
<div class="outline-text-4" id="text-1-4-3">
<ul class="org-ul">
<li>The linkage of this port should perhaps have been done directly by you,
or by an helper function already provided by <i>gem5</i>.</li>
<li>To distinguish between these two ways, search in the source code the
concerned object (here, <code>system.realview.generic_timer_mem</code>). Understand
its function, its ports, and so one.</li>
<li>One thing that can help a lot is the generated <code>config.dot.pdf</code>, which
give a graphical representation of the system (with links between
<i>SimObject</i>).</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org305b67b" class="outline-3">
<h3 id="org305b67b"><span class="section-number-3">1.5</span> Kernel panic - not syncing: VFS: Unable to mount root fs</h3>
<div class="outline-text-3" id="text-1-5">
</div>
<div id="outline-container-orgef1c2ae" class="outline-4">
<h4 id="orgef1c2ae"><span class="section-number-4">1.5.1</span> <b>Goal</b></h4>
<div class="outline-text-4" id="text-1-5-1">
<ul class="org-ul">
<li><p>
Troubleshoot this <i>kernel panic</i>:
</p>
<pre class="example" id="org7d200c5">
[    0.224367] List of all partitions:
[    0.224394] fe00         1048320 vda 
[    0.224397]  driver: virtio_blk
[    0.224440]   fe01         1048288 vda1 00000000-01
[    0.224441] 
[    0.224480] No filesystem could mount root, tried: 
[    0.224481]  ext3
[    0.224510]  ext4
[    0.224524]  ext2
[    0.224537]  squashfs
[    0.224551]  vfat
[    0.224566]  fuseblk
[    0.224579] 
[    0.224606] Kernel panic - not syncing: VFS: Unable to mount root fs on unknown-block(254,0)
[    0.224656] CPU: 0 PID: 1 Comm: swapper/0 Not tainted 4.18.0+ #1
[    0.224692] Hardware name: V2P-CA15 (DT)
[    0.224717] Call trace:
[    0.224741]  dump_backtrace+0x0/0x1c0
[    0.224765]  show_stack+0x14/0x20
[    0.224790]  dump_stack+0x8c/0xac
[    0.224812]  panic+0x130/0x288
[    0.224836]  mount_block_root+0x22c/0x294
[    0.224861]  mount_root+0x140/0x174
[    0.224884]  prepare_namespace+0x138/0x180
[    0.224910]  kernel_init_freeable+0x1c0/0x1e0
[    0.224939]  kernel_init+0x10/0x108
[    0.224961]  ret_from_fork+0x10/0x18
[    0.224987] Kernel Offset: disabled
[    0.225009] CPU features: 0x21c06492
[    0.225032] Memory Limit: 2048 MB
[    0.225056] ---[ end Kernel panic - not syncing: VFS: Unable to mount root fs on unknown-block(254,0) ]---

</pre></li>
</ul>
</div>
</div>

<div id="outline-container-org42106db" class="outline-4">
<h4 id="org42106db"><span class="section-number-4">1.5.2</span> <b>Explanation</b></h4>
<div class="outline-text-4" id="text-1-5-2">
<ul class="org-ul">
<li>This error is generated by the <i>Linux</i> kernel, in a
full-system-emulation setup.</li>
<li>We can see, from the error:
<ul class="org-ul">
<li>The kernel recognize the <i>VirtIO</i> block device, which means that this
driver is correctly loaded.</li>
<li>The kernel tried the <code>ext</code> file system, which means that the file
systems are correctly loaded.</li>
<li>The kernel detect a <code>vda1</code> partition.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org9b939af" class="outline-4">
<h4 id="org9b939af"><span class="section-number-4">1.5.3</span> <b>Resolution</b></h4>
<div class="outline-text-4" id="text-1-5-3">
<ul class="org-ul">
<li><p>
The problem lying into the <b>specification of the root partition</b>, on the
<b>kernel command line</b>. In the full-system emulation script, we have to
correctly set the root partition, like this:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #697375;"># </span><span style="color: #697375;">Linux kernel boot command flags.</span>
<span style="color: #47ba99;">kernel_cmd</span> = <span style="color: #4EB8CA;">[</span>
    ...
    <span style="color: #697375;"># </span><span style="color: #697375;">Tell Linux where to find the root disk image.</span>
    <span style="color: #fbaed2;">"root=/dev/vda1"</span>,
    ...
<span style="color: #4EB8CA;">]</span>
<span style="color: #47ba99;">system.workload.command_line</span> = <span style="color: #fbaed2;">" "</span>.join<span style="color: #4EB8CA;">(</span>kernel_cmd<span style="color: #4EB8CA;">)</span>
</pre>
</div></li>
<li>Don't forget to replace <code>...</code> with other correct options.</li>
<li>Before our modification, the <i>VirtIO</i> block device was specified
(<code>/dev/vda</code>). The kernel wants a partition (<code>/dev/vda1</code>), not a block
device.</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Pierre Ayoub</p>
<p class="date">Created: 2021-03-31 mer. 11:14</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
